FIRST_START_MESSAGE = """Привет! Скорее всего ты пока не понимаешь что происходит, но я готов рассказать.

Ты ведь пользуешься соцсетями и мессенджерами? 
В свое время они заменили нам форумы, потому что были более удобны и технологичны.

Так вот, уже в наше время на смену устаревшим технологиям также приходят новые платформы.

Вижу тебе уже интересно! Ты ведь знаешь про биткоин? Неплохо он вырос, да? Но мы немного забегаем наперед.

Сейчас зарождается новая эпоха социального интернета, которая уже очень скоро заменит твои любимые соцсети."""
SECOND_START_MESSAGE = """Почему же так будет? Ну, причин как всегда огромное множество, давай я расскажу про самые основые:

Во-первых, нынешние гиганты социального интернета воруют данные своих пользователей, и это уже даже не секрет. Зачем? Деньги. Иначе откуда еще берется персонализированная реклама в чатах и сообществах? Мало того, эти данные еще и регулярно сливаются хакерами, потому что хранятся на единых серверах. Погугли любой слив данных, например, Facebook и Cambrigde Analyticа.

Во-вторых, все авторы, инфлюенсеры и блогеры зависимы от рекламодателей и корпораций, что ограничивает свободу творчества, вводит цензуру и в конечном счете негативно влияет на их контент.

Ну и наконец та эхокамера, которую строят корпорации вокруг своих пользователей рекомендациями и персонализированным контентом очень мешает начинающим авторам пробиться наверх, а органическое продвижение привлекает к их контенту только ботов. Попробуй запостить в твиттер что нибудь с вирусным хештегом и поймешь о чем я."""
THIRD_START_MESSAGE = """Пора поговорить про решение этих проблем.

Ты знал, что есть соцсеть, где пользователи свободно зарабатывают на своем контенте? Более того, это социальная сеть нового, Web3 интернета, построенного на блокчейне.

Помнишь, мы говорили про биткоин? Да, эта социальная сеть имеет как минимум такой же потенциал, ведь имеет схожую технологию. Наши первые 30 000 пользователей уже это поняли, а мы даем тебе уникальный шанс стать совладельцем платформы MAIN - первой Web3 социальной сети по количеству пользователей.

Я — твой проводник в мир SocialFi, с помощью меня ты можешь ознакомиться с проектом, записаться на вебинар и стать Бэкером будущего фейсбука. 

Нажми внизу на кнопку меню, и я все тебе покажу."""
SUPPORT = """Мы готовы решить любой твой вопрос в кратчайшее время, для этого:

Вы можете позвонить нам с 09:00 до 21:00 по номеру
8(800)444-80-98

Напишите <b>«Поддержка»</b> и оператор свяжется с вами"""
MAIN_FROM_NUMMA = """Отлично, ты сразу видишь самый лёгкий путь, чтоб быстро купить самый серьезный актив следующего десятилетия

Обмен происходит через <b>«NUMMA»</b>

- За рубли с популярных банков России
- За криптовалюту

Оставляй заявку прямо сейчас 
@nummatexbot"""
MAIN_FROM_CRYPTO = """Сейчас я расскажу о том как поменять крипто на токен MAIN:

1. Переводим свою крипту на биржу
<a href='https://drive.google.com/file/d/1sDitgp7wRClaQE3IQ06DP0BRptLy0KqQ/view?usp=sharing'>Как завести и верифицировать аккаунт на Binance</a>

2. Конвертируем ее в BNB<a href='https://drive.google.com/file/d/1W9GfDVoWvKoXju-wY3PXJXhFRTOEOWDy/view?usp=sharing'>
Как конвертировать крипту на Binance в BNB</a>

3. Переводим BNB на TrustWallet по сети BEP20<a href='https://drive.google.com/file/d/1y6bzJq-4cOFj25_gl3Z9BIoLWQ1GJPZD/view?usp=sharing'>
Как завести кошелёк Trust</a> + <a href='https://drive.google.com/file/d/1m7W9FlLsBem3tqXCzCl0b8SxPPCZiAzn/view?usp=sharing'>Как перевести BNB с Binance на TrustWallet</a>

4. Покупаем MAIN за BNB через сервис PancakeSwap 
<a href='https://drive.google.com/file/d/1JBRvsHj4WTFHvWRpf-eXv0CL7AcITD9H/view?usp=sharing'>Как купить MAIN через PancakeSwap</a>"""
MAIN_FROM_BINANCE = """Приветствую Бэкер, если ты хочешь купить MAIN за рубли, то вот самый простой и дешевый способ в 4 шага: 

1. Создаём кошелёк Trust 
<a href='https://drive.google.com/file/d/1y6bzJq-4cOFj25_gl3Z9BIoLWQ1GJPZD/view?usp=sharing'>Как создать крипто кошелёк TrustWallet</a>

2. Регистрируемся на бирже Binance и верифицируем аккаунт 
<a href='https://drive.google.com/file/d/1sDitgp7wRClaQE3IQ06DP0BRptLy0KqQ/view?usp=sharing'>Как зарегистрироваться и верифицировать аккаунт на Binance</a>

3. Покупаем криптовалюту BNB для дальнейшей покупки токена MAIN. Есть 2 самых простых и дешевых (с минимальной комиссией) способа покупки BNB, разберем оба:

Способ «А»
Покупка BNB через кошелёк Trust 
<a href='https://drive.google.com/file/d/1jx3krNfy5Ny2H8uVhMSiBYVEQcZfr9_M/view?usp=sharing'>Как купить BNB за рубли через TrustWallet</a>

Способ «Б»
<a href='https://drive.google.com/file/d/1Ox5M9zXISJXJn3cAaxmhL1ZdtF0hfyvH/view?usp=sharing'>Покупка BNB на бирже Binance  Как купить BNB через Binance</a>

4. Если покупка была Способом «Б», переводим BNB с биржи Binance на кошелёк Trust по сети BEP20 
<a href='https://drive.google.com/file/d/1m7W9FlLsBem3tqXCzCl0b8SxPPCZiAzn/view?usp=sharing'>Как перевести BNB с Binance на TrustWallet</a>

5. Покупаем MAIN через сервис PancakeSwap 
<a href='https://drive.google.com/file/d/1JBRvsHj4WTFHvWRpf-eXv0CL7AcITD9H/view?usp=sharing'>Как купить MAIN на PancakeSwap</a>"""
STAKING_MAIN = """Да, тебе не показалось, наши партнёры EarnPark действительно дают 30% APY на MAIN, давай скорее стейкать: 

1. Регистрируемся на платформе EarnPark 

2. Вносим депозит и начинаем зарабатывать 
<a href='https://drive.google.com/file/d/1KazBfSSzIMlwtJ1NKRpkY3lMo9aWwjXT/view?usp=sharing'>Как зарегистрироваться и внести депозит на EarnPark</a>

ВАЖНО!
а) Вывод средств с платформы EarnPark осуществляется 1 раз в квартал, число вывода платформа обозначает заранее на сайте, оно может меняться. 

б) Срок вывода денежных средств составляет от 1 недели до 1 месяца 

в) Заявку на вывод MAIN вы можете создать минимум за 1 неделю до фактического вывода средств. 

3. После того как депозит отработал, выводим свои средства на кошелёк 
<a href='https://drive.google.com/file/d/130iOjcF__tLO9FPudrwnYMXK4OJ5L42Q/view?usp=sharing'>Как вывести свои средства с EarnPark на TrustWallet</a>"""
SELL_MAIN = """Если ты на это решился значит прошел уже как минимум год с момента покупки токенов, если нет - ты многое теряешь! Но выбор за тобой, а вот подробный гайд как продать свои MAIN 

1. Конвертируем MAIN в BNB через сервис PankakeSwap 
<a href='https://drive.google.com/file/d/17myY2k9pk0HmRkU7ZwlI13NsxrrAMQ4t/view?usp=sharing'>Как конвертировать MAIN в BNB</a>

2. Переводим MAIN на биржу 
<a href='https://drive.google.com/file/d/1lvvrNZFIsUa6XnTC0q4xWKZ9x6AE_JKQ/view?usp=sharing'>Как перевести MAIN на Binance</a>

3. Продаем BNB на бирже 
<a href='https://drive.google.com/file/d/1ggvjeNZcA4Ts9CPOD4HM0yNZBVDfjqct/view?usp=sharing'>Как продать BNB на Binance</a>

4. По желанию выводим средства с биржи 
<a href='https://drive.google.com/file/d/1rsD9BkwN6Lr9GenCwDZhU7AotTjPoOv0/view?usp=sharing'>Как вывести рубли на карту с Binance</a>"""
ASK_ACCESS = """Привет, держи доступ, соблюдай правила сообщества, будь в курсе» допишу"""
PANCAKE_SWAP = """Хорошо что ты идешь в ногу со временем и уже в лодке с блокчейном, держи мануал, который поможет тебе превратить действующую крипту в самый серьезный актив следующего десятилетия 👇

1. Переводим свою крипту на биржу
<a href='https://drive.google.com/file/d/1sDitgp7wRClaQE3IQ06DP0BRptLy0KqQ/view?usp=sharing'>Как завести и верифицировать аккаунт на Binance</a>

2. Конвертируем ее в BNB  
<a href='https://drive.google.com/file/d/1W9GfDVoWvKoXju-wY3PXJXhFRTOEOWDy/view?usp=sharing'>Как конвертировать крипту на Binance в BNB</a>

3. Переводим BNB на TrustWallet по сети BEP20
<a href='https://drive.google.com/file/d/1y6bzJq-4cOFj25_gl3Z9BIoLWQ1GJPZD/view?usp=sharing'>Как завести кошелёк Trust</a> + <a href='https://drive.google.com/file/d/1m7W9FlLsBem3tqXCzCl0b8SxPPCZiAzn/view?usp=sharing'>Как перевести BNB с Binance на TrustWallet</a>

4. Покупаем MAIN за BNB через сервис PancakeSwap 
<a href='https://drive.google.com/file/d/1JBRvsHj4WTFHvWRpf-eXv0CL7AcITD9H/view?usp=sharing'>Как купить MAIN на PancakeSwap</a>"""
WEBINAR_MSG="""Привет! Я помогу тебе присоединиться к онлайн встрече MAIN. Нажимай на кнопку Меню в левом нижнем углу и тебе откроется интрумент для записи на встречу — в нем нажми "Пойти на онлайн встречу"."""